<a href="https://colab.research.google.com/github/hyunicecream/Inflearn/blob/main/1_3_%EB%8D%B0%EC%9D%B4%ED%84%B0%ED%94%84%EB%A0%88%EC%9E%84_%EC%83%9D%EC%84%B1%ED%95%98%EA%B8%B0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
friend_dict_list = [
  {'name':'John', 'age':25, 'job':'student'},
  {'name':'Nate', 'age':30, 'job':'teacher'}                  
]

In [ ]:
df = pd.DataFrame(friend_dict_list)

In [ ]:
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [ ]:
# 순서 변경
df = df[['age', 'name', 'job']]
df.head()

   age  name      job
0   25  John  student
1   30  Nate  teacher

In [ ]:
from collections import OrderedDict
# OrderedDict : 데이터프레임을 만들때 key의 순서를 보장한다.

In [ ]:
friend_ordered_dict = OrderedDict(
    [
     ('name', ['John', 'Nate']),
     ('age', [25,30]),
     ('job', ['student', 'teacher']),
    ]
)

In [ ]:
df = pd.DataFrame.from_dict(friend_ordered_dict)
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [ ]:
# 파이썬의 list를 사용해서 만들기
friend_list = [
    ['John', 20, 'student'],
    ['Nate', 30, 'teacher']              
]

In [ ]:
# 컬럼 해더 정보 
column_name = ['name', 'age', 'job']

In [ ]:
df = pd.DataFrame.from_records(friend_list, columns = column_name)

In [ ]:
df.head()

   name  age      job
0  John   20  student
1  Nate   30  teacher

In [ ]:
friend_list_1 = [
    ['name', ['John', 'Nate']],
    ['age', ['25', '30']],
    ['job', ['student', 'teacher']],
]

In [ ]:
df = pd.DataFrame.from_items(friend_list_1)
df.head()